
//Написать программу, которая будет печатать/выводить следующий текст:
//
//3
//2
//1
//Поехали!!!
package hw1;

public class Hw1_1 {
    public static void main(String[] args) {
        System.out.println("3\n2\n1\nПоехали!!!");
    }
}
